In [82]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

# Construct your Postgres URI
import urllib.parse
pw = urllib.parse.quote_plus("@Woodlandscollege7696") #Because our password contains an @, this will encode special characters (like @) into safe representations so we can pass this into our create_engine functions without breaking the format, since it only expects to see one @

# postgresql+psycopg2://  user  :  pass  @  host  /database_name   <- format
engine = create_engine(f"postgresql+psycopg2://postgres:{pw}@localhost/postgres")
# We use this engine in Postgres when we do pd_read_query(sql statement, con) where con is engine since this is what pandas expects to see, not the psycopg2 connection.

def get_conn():
    return psycopg2.connect(
        host = "localhost,",
        dbname = "postgres",
        user = "postgres",
        password = "@Woodlandscollege7696"
    )

with get_conn() as conn:
    with conn.cursor() as cur:
        cur.execute("""
        CREATE TABLE IF NOT EXISTS EMPLOYEES(
        EP_ID INTEGER PRIMARY KEY,
        FIRST_NAME VARCHAR(30),
        LAST_NAME VARCHAR(30),
        SALARY FLOAT,
        EMPLOYED_SINCE DATE
        )
        """)

# Pandas can use the engine directly
tables = pd.read_sql_query("SELECT * FROM EMPLOYEES", engine)
tables.head()

Empty DataFrame
Columns: [ep_id, first_name, last_name, salary, employed_since]
Index: []

In [86]:
with get_conn() as conn:
    with conn.cursor() as cur:
        tables = cur.execute("""
            SELECT table_name
            FROM information_schema.tables
            WHERE table_schema = 'public'
            """)
        tables = cur.fetchall()
        print(tables)

[('employees',)]

In [88]:
with get_conn() as conn:
    with conn.cursor() as cur:
        cur.execute("""
            INSERT INTO EMPLOYEES
            VALUES (1, 'Daniel', 'Lawless', 99000, '2025-05-16'),
                   (2, 'Dennis', 'Lawless', 50000, '2024-01-01'),
                   (3, 'Matt', 'Oldfield', 70000, '2025-02-09'),
                   (4, 'Josh', 'Richie', 20000, '2023-11-14')
        """)

In [90]:
EMPLOYEES = pd.read_sql_query("SELECT * FROM EMPLOYEES", engine)
EMPLOYEES.head()

   ep_id first_name last_name   salary employed_since
0      1     Daniel   Lawless  99000.0     2025-05-16
1      2     Dennis   Lawless  50000.0     2024-01-01
2      3       Matt  Oldfield  70000.0     2025-02-09
3      4       Josh    Richie  20000.0     2023-11-14

In [102]:
average_salary = pd.read_sql_query("SELECT AVG(SALARY) FROM EMPLOYEES", engine)
print(average_salary)

       avg
0  59750.0

In [105]:
EMPLOYEES_hired_in_2025 = pd.read_sql_query(""" SELECT EP_ID, FIRST_NAME
                            FROM EMPLOYEES
                            WHERE EXTRACT(YEAR FROM EMPLOYED_SINCE) = 2025
                                         """, engine)

EMPLOYEES_hired_in_2025.head()

   ep_id first_name
0      1     Daniel
1      3       Matt